Revit 2027 API
StoneApplicationType Enumeration
 The enumerated type representing the permitted values for the asset property "StoneApplication" from the "Stone" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StoneApplicationType
Public Enumeration StoneApplicationType
public enum class StoneApplicationType
type StoneApplicationType
Members
Member name | Value | Description
Glossy | 1
Matte | 2
Polished | 0
Unfinished | 3
See Also
Reference
Autodesk.Revit.DB.Visual Namespace